import '../../reset.css';
import '../../dependencies.css';
import React from 'react';
import ReactDOM from 'react-dom/client';
import Button from '../widget/Button.jsx';
import ButtonContainer from '../widget/ButtonContainer.jsx';


const icon_3 = <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
    <path d="M13.164 8.46001C13.2187 8.99591 13.25 9.51458 13.25 10C13.25 10.9087 13.1402 11.9348 12.9722 12.9722C11.9348 13.1402 10.9087 13.25 10 13.25C9.09543 13.25 8.06965 13.1405 7.02772 12.9719C6.85982 11.9345 6.75 10.9086 6.75 10C6.75 9.51477 6.78132 8.99601 6.83609 8.46001C7.9296 8.63505 9.02048 8.75001 10 8.75001C10.9796 8.75001 12.0705 8.63505 13.164 8.46001Z" fill="var(--color-content-100)" />
    <path d="M14.643 8.18991C14.7107 8.81705 14.75 9.42762 14.75 10C14.75 10.8351 14.6664 11.7513 14.5332 12.6812C16.4214 12.2872 18.1667 11.7839 19.1016 11.4973C19.4037 11.4048 19.5225 11.3679 19.6817 11.3042C19.7613 11.2724 19.8343 11.24 19.9294 11.1946C19.976 10.8029 20 10.4042 20 10C20 8.93143 19.8324 7.90204 19.5221 6.93663L19.4412 6.96207C18.4636 7.25948 16.6335 7.78524 14.643 8.18991Z" fill="var(--color-content-100)" />
    <path d="M18.954 5.54236C17.9712 5.8402 16.2657 6.32418 14.438 6.70098C14.0169 4.14215 13.279 1.59001 12.924 0.434265C15.564 1.24026 17.7403 3.10921 18.954 5.54236Z" fill="var(--color-content-100)" />
    <path d="M12.9635 6.97361C11.9289 7.14077 10.906 7.25 10 7.25C9.09402 7.25 8.07123 7.14077 7.03662 6.97362C7.43308 4.55243 8.14078 2.0791 8.50269 0.89841C8.59526 0.596248 8.63212 0.477562 8.69583 0.318267C8.72764 0.238686 8.76002 0.165695 8.80545 0.0706095C9.19716 0.0239809 9.59583 0 10 0C10.4223 0 10.8384 0.0261714 11.247 0.0769809C11.2556 0.110133 11.2636 0.1398 11.2715 0.167867C11.295 0.25079 11.3316 0.367333 11.3932 0.562895L11.3996 0.583438C11.7081 1.56403 12.5256 4.29906 12.9635 6.97361Z" fill="var(--color-content-100)" />
    <path d="M5.56195 6.70096C5.98105 4.15341 6.71416 1.61502 7.0685 0.458875L7.07603 0.434265C4.43597 1.24025 2.25972 3.1092 1.04605 5.54235C2.02875 5.84019 3.73424 6.32416 5.56195 6.70096Z" fill="var(--color-content-100)" />
    <path d="M0.477943 6.93663C0.1676 7.90205 0 8.93144 0 10C0 10.418 0.0256476 10.83 0.0754571 11.2346L0.233057 11.2872L0.234314 11.2875L0.235857 11.2881L0.236943 11.2884C0.287667 11.3052 1.77433 11.7962 3.73217 12.2833C4.28463 12.4208 4.86959 12.5566 5.46672 12.6811C5.33357 11.7512 5.25 10.8352 5.25 10C5.25 9.42744 5.28928 8.81687 5.35688 8.18992C3.36598 7.78512 1.53541 7.25917 0.558067 6.96181L0.551267 6.95973L0.477943 6.93663Z" fill="var(--color-content-100)" />
    <path d="M10 14.75C10.8352 14.75 11.7513 14.6664 12.6812 14.5332C12.2872 16.4214 11.7839 18.1667 11.4973 19.1015C11.4048 19.4037 11.3679 19.5224 11.3042 19.6817C11.2724 19.7613 11.24 19.8343 11.1946 19.9294C10.8029 19.976 10.4042 20 10 20C9.59582 20 9.19715 19.976 8.80544 19.9294C8.76001 19.8343 8.72763 19.7613 8.69582 19.6817C8.6321 19.5225 8.59525 19.4037 8.50268 19.1016C8.2161 18.1668 7.71283 16.4216 7.31885 14.5336C8.24563 14.6663 9.16201 14.75 10 14.75Z" fill="var(--color-content-100)" />
    <path d="M3.36998 13.739C2.13191 13.4309 1.07745 13.1214 0.434235 12.924C1.40243 16.0954 3.90457 18.5975 7.07601 19.5657L7.06847 19.5412C6.75907 18.5316 6.1609 16.4683 5.73513 14.2652C4.90712 14.1051 4.10209 13.9211 3.36998 13.739Z" fill="var(--color-content-100)" />
    <path d="M19.5411 12.9315C18.5316 13.241 16.4681 13.8392 14.2648 14.2649C13.8391 16.4681 13.2409 18.5315 12.9315 19.5412L12.924 19.5657C16.0954 18.5975 18.5975 16.0954 19.5657 12.924L19.5411 12.9315Z" fill="var(--color-content-100)" />
    <path d="M0.105042 11.26C0.139661 11.2645 0.16788 11.2692 0.177242 11.2713C0.185442 11.2733 0.198289 11.2768 0.202946 11.278L0.213242 11.281L0.218784 11.2827L0.224613 11.2845L0.229499 11.286C0.226756 11.2852 0.171194 11.2712 0.105042 11.26Z" fill="var(--color-content-100)" />
</svg>


const e = React.createElement;
const AppReact = () => {
    const icon = <svg
        width="18"
        height="31"
        viewBox="0 0 18 31"
        fill="none"
        xmlns="http://www.w3.org/2000/svg">
        <path d="M16.2767 1.61781C17.2087 2.40881 17.6857 3.53481 17.6857 4.66981C17.6857 5.58281 17.3737 6.50381 16.7367 7.25681L9.58473 15.6768L16.7357 24.0968C18.1657 25.7798 17.9607 28.3048 16.2767 29.7358C14.5907 31.1658 12.0687 30.9598 10.6367 29.2758L1.28573 18.2658C0.0167344 16.7728 0.0167344 14.5798 1.28573 13.0878L10.6367 2.07681C12.0687 0.392809 14.5917 0.187809 16.2767 1.61781Z" fill="#000" />
    </svg>

    const icon_2 = <svg width="13" height="13" viewBox="0 0 13 13" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M1.00006 7L12.0001 7" stroke="var(--color-content-100)" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
        <path d="M6.49994 12L6.49994 1" stroke="var(--color-content-100)" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
    </svg>


    return <>
        <div id="frame">
            <Button
                style={{ width: "20em", fontSize: "1.5rem" }}
                icon={icon_3}
                description="Мой текст описанные тут"
                >My Button Card
            </Button>

            <Button
                style={{ marginTop: "10px" }}
                icon={icon_2}
                isLight={true}
                >My tags
            </Button>

            <Button
                style={{ marginTop: "10px", /*fontSize : ".2rem"*/ }}
                icon={icon_2}
                isLarge={true}
                >My Menu Button
            </Button>

            <Button
                style={{ marginTop: "10px", /*fontSize : ".2rem"*/ }}
                icon={"IcoLoading"}

                onBtnClick={() => console.log("ok")}
                >My StButton
            </Button>

            <Button
                style={{ marginTop: "10px", /*fontSize : ".2rem"*/ }}
                icon={icon_2}
                onBtnClick={() => console.log("Кнопка без текста")}
            />

            <ButtonContainer style={{ marginTop: "10px", /*fontSize : ".2rem"*/ }} >
                <Button
                    icon={icon_2}
                    >My Menu Button
                </Button>

                <Button
                    icon={icon_2}
                    onBtnClick={() => console.log("Кнопка без текста")}
                />

                <Button
                    icon={icon_3}
                />
            </ButtonContainer>

            <Button
                style={{ width: "20em", fontSize: "1.5rem", marginTop: "10px" }}
                icon={icon_3}
                onBtnClick={() => console.log("Кнопка без текста")}
                // description="Мой текст описанные тут"
                tooltop="Ну типа эта кнопка делает что-то"
                widgets={[

                    <div>123</div>
                ]}
                >Кнопка с виджетами
            </Button>

        </div>


        {/* ↓ кнопка переключения цветовой схемы */}
        <button
            className='change-theme'
            onClick={() => {
                document.body.classList.toggle('dark-theme')
            }}
        >dark<br />light</button>
    </>
}

const domContainer = document.querySelector('#root');
const root = ReactDOM.createRoot(domContainer);
root.render(e(AppReact));